src/InformationRegisters/ЗИПТребуемыеДляТОПредметовСнабжения/ЗИПТребуемыеДляТОПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗИПТребуемыеДляТОПредметовСнабжения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗИП</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДополнительныеНаименования/ДополнительныеНаименования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНаименования</name>
  <comment>Наименования элементов структуры заказа и предметов снабжения на иностранном языке</comment>
  <resources>
    <name>Перевод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <comment>Предмет снабжения либо элемент структуры заказа с типом &quot;Группа&quot;</comment>
    <type>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.ХарактеристикиКораблей</types>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
      <types>CatalogRef.Флоты</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.Языки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РесурсыИСрокиСлужбыПредметовСнабжения/РесурсыИСрокиСлужбыПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РесурсыИСрокиСлужбыПредметовСнабжения</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ТипыПоказателейИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РегламентТОПредметовСнабжения/РегламентТОПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегламентТОПредметовСнабжения</name>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоемкостьРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоемкостьСопутствующихРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПериодичности</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПродолжительности</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СтруктураЗаказаПоКомплектующимИзделиямИЗИП/СтруктураЗаказаПоКомплектующимИзделиямИЗИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураЗаказаПоКомплектующимИзделиямИЗИП</name>
  <comment>Электронная структура комплектующих изделий и ЗИП корабля</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Заказы</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
    </type>
  </attributes>
  <attributes>
    <name>Заведование</name>
    <type>
      <types>CatalogRef.БоевыеЧасти</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <comment>Используется для элементов с типом &quot;Группа изделий&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСнабжения</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБорт</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБаза</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПДЭ</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПР</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленИзСпецификации</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;. Значение Истина означает программное создание при обработке изменений спецификации предмета снабжения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЧасти</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПозицииСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПодчиненные</name>
    <comment>признак того, что элемент является родителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ТипыПоказателейИзделий/ТипыПоказателейИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыПоказателейИзделий</name>
  <predefined>
    <items>
      <name>НаработкаНаОтказ</name>
      <description>Наработка на отказ</description>
    </items>
    <items>
      <name>НазначенныйРесурсДоЗаводскогоРемонта</name>
      <description>Ресурс до ремонта</description>
    </items>
    <items>
      <name>НазначенныйРесурсДоСписания</name>
      <description>Ресурс до списания</description>
    </items>
    <items>
      <name>СрокИзготовления</name>
      <description>Срок изготовления</description>
    </items>
    <items>
      <name>НазначенныйСрокСлужбыДоЗаводскогоРемонта</name>
      <description>Срок службы до ремонта</description>
    </items>
    <items>
      <name>НазначенныйСрокСлужбыДоСписания</name>
      <description>Срок службы до списания</description>
    </items>
    <items>
      <name>СрокХранения</name>
      <description>Срок хранения</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ОписаниеINCAT/Module.bsl
//////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьЗапросСВременнымиТаблицами(Корабль, ПредметСнабжения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Родитель.ПредметСнабжения КАК ПредметСнабжения
	|ПОМЕСТИТЬ ВТ_ПредметыСнабжения
	|ИЗ
	|	Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|ГДЕ
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец = &Корабль
	|	И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Родитель.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Группа)
	|   И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения = &ПредметСнабжения
	|;";

	
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения КАК ПредметСнабжения,
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Родитель КАК Родитель,
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Код КАК Код,
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Количество КАК Количество,
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втСтруктураЗаказа
	|ИЗ
	|	Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|ГДЕ
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец = &Корабль
	|	И (СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Количество > 0
	|			ИЛИ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПБорт > 0
	|			ИЛИ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПБаза > 0
	|			ИЛИ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПДЭ > 0)
	|	И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Ссылка В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Ссылка КАК Ссылка
	|				ИЗ
	|					Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|				ГДЕ
	|					СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец = &Корабль
	|					И (СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Наименование = ""Архив""
	|							И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Родитель = ЗНАЧЕНИЕ(Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПустаяСсылка)
	|							И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Группа)
	|						ИЛИ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения.NSN = """"
	|							И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения.ФНН = """"
	|							И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения.INCAT = """"))
	|	И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Группа)
	
	|   И (СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения = &ПредметСнабжения ИЛИ
	|   СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения В (ВЫБРАТЬ ВТ.ПредметСнабжения ИЗ ВТ_ПредметыСнабжения КАК ВТ))
	
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втСтруктураЗаказа.ПредметСнабжения КАК ПредметСнабжения,
	|	НЕОПРЕДЕЛЕНО КАК ОригинальныйПредметСнабжения,
	|	"""" КАК ТипЗамены
	|ПОМЕСТИТЬ втПредметыСнабженияКорабляИАналоги
	|ИЗ
	|	втСтруктураЗаказа КАК втСтруктураЗаказа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КаталогПредметовСнабженияАналоги.Аналог,
	|	КаталогПредметовСнабженияАналоги.Ссылка,
	|	КаталогПредметовСнабженияАналоги.ТипЗамены
	|ИЗ
	|	втСтруктураЗаказа КАК втСтруктураЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения.Аналоги КАК КаталогПредметовСнабженияАналоги
	|		ПО втСтруктураЗаказа.ПредметСнабжения = КаталогПредметовСнабженияАналоги.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗИПТребуемыеДляТОПредметовСнабжения.ЗИП,
	|	НЕОПРЕДЕЛЕНО,
	|	""""
	|ИЗ
	|	РегистрСведений.ЗИПТребуемыеДляТОПредметовСнабжения КАК ЗИПТребуемыеДляТОПредметовСнабжения
	|ГДЕ
	|	ЗИПТребуемыеДляТОПредметовСнабжения.ПредметСнабжения В
	|			(ВЫБРАТЬ
	|				втСтруктураЗаказа.ПредметСнабжения
	|			ИЗ
	|				втСтруктураЗаказа КАК втСтруктураЗаказа)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КаталогПредметовСнабжения.Ссылка КАК ПредметСнабжения,
	|	КаталогПредметовСнабжения.INCAT КАК Код,
	|	ПОДСТРОКА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ДополнительныеНаименования.Перевод, """") = """"
	|				ТОГДА КаталогПредметовСнабжения.Наименование
	|			ИНАЧЕ ДополнительныеНаименования.Перевод
	|		КОНЕЦ, 1, 60) КАК Наименование,
	|	ПОДСТРОКА(ЕСТЬNULL(ОКЕИ.УсловноеОбозначениеМеждународное, """"), 1, 3) КАК ЕдиницаИзмерения,
	|	СУММА(ВЫБОР
	|			КОГДА РесурсыИСрокиСлужбыПредметовСнабжения.ЕдиницаИзмерения = &Месяц
	|				ТОГДА ЕСТЬNULL(РесурсыИСрокиСлужбыПредметовСнабжения.Значение, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СрокХранения,
	|	КаталогПредметовСнабжения.ОбозначениеТранслитированное КАК Обозначение,
	|	втПредметыСнабженияКорабляИАналоги.ОригинальныйПредметСнабжения КАК ОригинальныйПредметСнабжения,
	|	втПредметыСнабженияКорабляИАналоги.ТипЗамены КАК ТипЗамены,
	|	КаталогПредметовСнабжения.ДокументНаПоставку КАК ДокументНаПоставку
	|ПОМЕСТИТЬ втПредметыСнабжения
	|ИЗ
	|	втПредметыСнабженияКорабляИАналоги КАК втПредметыСнабженияКорабляИАналоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения КАК КаталогПредметовСнабжения
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеНаименования КАК ДополнительныеНаименования
	|			ПО КаталогПредметовСнабжения.Ссылка = ДополнительныеНаименования.Владелец
	|				И (ДополнительныеНаименования.ИмяРеквизита = ""Наименование"")
	|				И (ДополнительныеНаименования.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Английский))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКЕИ КАК ОКЕИ
	|			ПО КаталогПредметовСнабжения.ЕдиницаИзмерения = ОКЕИ.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РесурсыИСрокиСлужбыПредметовСнабжения КАК РесурсыИСрокиСлужбыПредметовСнабжения
	|			ПО КаталогПредметовСнабжения.Ссылка = РесурсыИСрокиСлужбыПредметовСнабжения.ПредметСнабжения
	|				И (РесурсыИСрокиСлужбыПредметовСнабжения.Показатель = ЗНАЧЕНИЕ(Справочник.ТипыПоказателейИзделий.СрокХранения))
	|		ПО втПредметыСнабженияКорабляИАналоги.ПредметСнабжения = КаталогПредметовСнабжения.Ссылка
	|ГДЕ
	|	НЕ КаталогПредметовСнабжения.INCAT = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	КаталогПредметовСнабжения.Ссылка,
	|	ПОДСТРОКА(ЕСТЬNULL(ОКЕИ.УсловноеОбозначениеМеждународное, """"), 1, 3),
	|	ПОДСТРОКА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ДополнительныеНаименования.Перевод, """") = """"
	|				ТОГДА КаталогПредметовСнабжения.Наименование
	|			ИНАЧЕ ДополнительныеНаименования.Перевод
	|		КОНЕЦ, 1, 60),
	|	КаталогПредметовСнабжения.ОбозначениеТранслитированное,
	|	втПредметыСнабженияКорабляИАналоги.ОригинальныйПредметСнабжения,
	|	втПредметыСнабженияКорабляИАналоги.ТипЗамены,
	|	КаталогПредметовСнабжения.ДокументНаПоставку,
	|	КаталогПредметовСнабжения.INCAT
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения,
	|	ОригинальныйПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втПредметыСнабженияКорабляИАналоги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	Организации.КодCAGE КАК Код,
	|	ПОДСТРОКА(ВЫБОР
	|			КОГДА Организации.НазваниеОрганизацииАнгл = """"
	|				ТОГДА Организации.Наименование
	|			ИНАЧЕ Организации.НазваниеОрганизацииАнгл
	|		КОНЕЦ, 1, 50) КАК Наименование,
	|	ПОДСТРОКА(Организации.ИмяКонтакногоЛицаАнгл, 1, 30) КАК ИмяКонтакногоЛицаАнгл,
	|	ПОДСТРОКА(Организации.АдресАнгл, 1, 30) КАК АдресАнгл1,
	|	ПОДСТРОКА(Организации.АдресАнгл, 31, 30) КАК АдресАнгл2,
	|	ПОДСТРОКА(Организации.АдресАнгл, 61, 30) КАК АдресАнгл3,
	|	ПОДСТРОКА(Организации.ГородАнгл, 1, 30) КАК ГородАнгл,
	|	ПОДСТРОКА(Организации.РегионАнгл, 1, 20) КАК РегионАнгл,
	|	Организации.ПочтовыйИндекс КАК ПочтовыйИндекс,
	|	ПОДСТРОКА(Организации.ОКПО, 1, 9) КАК ОКПО,
	|	ПОДСТРОКА(ОрганизацииКонтактнаяИнформацияТелефон.Представление, 1, 100) КАК Телефоны,
	|	ОрганизацииКонтактнаяИнформацияФакс.Представление КАК Факс,
	|	ОрганизацииКонтактнаяИнформацияЭлектроннаяПочта.Представление КАК ЭлектроннаяПочта,
	|	ИСТИНА КАК ОсновнаяОрганизация,
	|	Организации.КодСертификата КАК КодСертификата,
	|	Организации.НомерСертификата КАК НомерСертификата
	|ПОМЕСТИТЬ втОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияТелефон
	|		ПО (ОрганизацииКонтактнаяИнформацияТелефон.Ссылка = Организации.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Телефон))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияФакс
	|		ПО (ОрганизацииКонтактнаяИнформацияФакс.Ссылка = Организации.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформацияФакс.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Факс))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияЭлектроннаяПочта
	|		ПО (ОрганизацииКонтактнаяИнформацияЭлектроннаяПочта.Ссылка = Организации.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформацияЭлектроннаяПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЭлектроннаяПочта))
	|ГДЕ
	|	Организации.Ссылка В
	|			(ВЫБРАТЬ
	|				ОсновнаяОрганизация.Значение КАК Значение
	|			ИЗ
	|				Константа.ОсновнаяОрганизация КАК ОсновнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОсновнаяОрганизация";
	
	
	Запрос.УстановитьПараметр("Корабль", Корабль);
	Запрос.УстановитьПараметр("Месяц", Справочники.ОКЕИ.НайтиПоКоду("362")); 
	Запрос.УстановитьПараметр("КодПоставщика", Константы.ОсновнаяОрганизация.Получить().КодCAGE);
	
	Запрос.УстановитьПараметр("ПредметСнабжения", ПредметСнабжения);
	Запрос.УстановитьПараметр("ГодПостройки", Число(Формат(Корабль.ДатаПостройки, "ДФ=yyyy"))); //определим здесь

	Запрос.Выполнить();
	
	Возврат Запрос; 
	
КонецФункции 

Функция СформироватьТаблицуItem(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   втПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	втПредметыСнабжения.Код КАК Код,
	|	втПредметыСнабжения.Наименование КАК Наименование,
	|	втПредметыСнабжения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втПредметыСнабжения.СрокХранения КАК СрокХранения
	|ИЗ
	|	втПредметыСнабжения КАК втПредметыСнабжения";
	
	Запрос.Текст = Запрос.Текст + "
	|ГДЕ втПредметыСнабжения.ПредметСнабжения = &ПредметСнабжения";
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция СформироватьТаблицуVendor(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	втОрганизации.Организация КАК Организация,
	|	втОрганизации.Код КАК Код,
	|	втОрганизации.Наименование КАК Наименование,
	|	втОрганизации.ИмяКонтакногоЛицаАнгл КАК ИмяКонтакногоЛицаАнгл,
	|	втОрганизации.АдресАнгл1 КАК АдресАнгл1,
	|	втОрганизации.АдресАнгл2 КАК АдресАнгл2,
	|	втОрганизации.АдресАнгл3 КАК АдресАнгл3,
	|	втОрганизации.ГородАнгл КАК ГородАнгл,
	|	втОрганизации.РегионАнгл КАК РегионАнгл,
	|	втОрганизации.ПочтовыйИндекс КАК ПочтовыйИндекс,
	|   ""RUS"" КАК КодСтраны,
	|	втОрганизации.ОКПО КАК ОКПО,
	|	втОрганизации.Телефоны КАК Телефоны,
	|	втОрганизации.Факс КАК Факс,
	|	втОрганизации.ЭлектроннаяПочта КАК ЭлектроннаяПочта
	|ИЗ
	|	втОрганизации КАК втОрганизации";
	
	Возврат Запрос.Выполнить().Выгрузить();
				
КонецФункции

Функция СформироватьТаблицуEqpt(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втСтруктураЗаказа.ПредметСнабжения КАК ПредметСнабжения,
	|	ЕСТЬNULL(РесурсыИСрокиСлужбыПредметовСнабжения.Показатель, НЕОПРЕДЕЛЕНО) КАК Показатель,
	|	ЕСТЬNULL(РесурсыИСрокиСлужбыПредметовСнабжения.Значение, 0) КАК Значение,
	|	втПредметыСнабжения.Код КАК Код
	|ПОМЕСТИТЬ втРесурсы
	|ИЗ
	|	втСтруктураЗаказа КАК втСтруктураЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РесурсыИСрокиСлужбыПредметовСнабжения КАК РесурсыИСрокиСлужбыПредметовСнабжения
	|		ПО втСтруктураЗаказа.ПредметСнабжения = РесурсыИСрокиСлужбыПредметовСнабжения.ПредметСнабжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПредметыСнабжения КАК втПредметыСнабжения
	|		ПО втСтруктураЗаказа.ПредметСнабжения = втПредметыСнабжения.ПредметСнабжения
	|ГДЕ
	|	(НЕ РесурсыИСрокиСлужбыПредметовСнабжения.ПредметСнабжения ЕСТЬ NULL
	|			ИЛИ втСтруктураЗаказа.ПредметСнабжения В
	|				(ВЫБРАТЬ
	|					РегламентТОПредметовСнабжения.ПредметСнабжения КАК ПредметСнабжения
	|				ИЗ
	|					РегистрСведений.РегламентТОПредметовСнабжения КАК РегламентТОПредметовСнабжения))
	|	И РесурсыИСрокиСлужбыПредметовСнабжения.ЕдиницаИзмерения = &Час
	|   //%Условие%
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПредметСнабжения КАК ПредметСнабжения,
	|	ВложенныйЗапрос.СрокСлужбы КАК СрокСлужбы,
	|	ВложенныйЗапрос.НаработкаНаОтказ КАК НаработкаНаОтказ,
	|	ВложенныйЗапрос.НаработкаНаРемонт КАК НаработкаНаРемонт,
	|	ВложенныйЗапрос.Код КАК Код,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СрокСлужбы > 0
	|				И &ГодПостройки > 0
	|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.СрокСлужбы / 8766 + &ГодПостройки КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ГодУстаревания
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПредметСнабжения КАК ПредметСнабжения,
	|		МАКСИМУМ(ВложенныйЗапрос.СрокСлужбы) КАК СрокСлужбы,
	|		МАКСИМУМ(ВложенныйЗапрос.НаработкаНаОтказ) КАК НаработкаНаОтказ,
	|		МАКСИМУМ(ВложенныйЗапрос.НаработкаНаРемонт) КАК НаработкаНаРемонт,
	|		ВложенныйЗапрос.Код КАК Код
	|	ИЗ
	|		(ВЫБРАТЬ
	|			втРесурсы.ПредметСнабжения КАК ПредметСнабжения,
	|			ВЫБОР
	|				КОГДА втРесурсы.Показатель = ЗНАЧЕНИЕ(Справочник.ТипыПоказателейИзделий.НазначенныйСрокСлужбыДоСписания)
	|					ТОГДА втРесурсы.Значение
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СрокСлужбы,
	|			0 КАК НаработкаНаОтказ,
	|			0 КАК НаработкаНаРемонт,
	|			втРесурсы.Код КАК Код
	|		ИЗ
	|			втРесурсы КАК втРесурсы
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			втРесурсы.ПредметСнабжения,
	|			0,
	|			ВЫБОР
	|				КОГДА втРесурсы.Показатель = ЗНАЧЕНИЕ(Справочник.ТипыПоказателейИзделий.НаработкаНаОтказ)
	|					ТОГДА втРесурсы.Значение
	|				ИНАЧЕ 0
	|			КОНЕЦ,
	|			0,
	|			втРесурсы.Код
	|		ИЗ
	|			втРесурсы КАК втРесурсы
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			втРесурсы.ПредметСнабжения,
	|			0,
	|			0,
	|			ВЫБОР
	|				КОГДА втРесурсы.Показатель = ЗНАЧЕНИЕ(Справочник.ТипыПоказателейИзделий.НазначенныйРесурсДоЗаводскогоРемонта)
	|					ТОГДА втРесурсы.Значение
	|				ИНАЧЕ 0
	|			КОНЕЦ,
	|			втРесурсы.Код
	|		ИЗ
	|			втРесурсы КАК втРесурсы) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ПредметСнабжения,
	|		ВложенныйЗапрос.Код) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втРесурсы";
	
	Запрос.УстановитьПараметр("Час", Справочники.ОКЕИ.НайтиПоКоду("356"));
	Запрос.УстановитьПараметр("Год", Справочники.ОКЕИ.НайтиПоКоду("366"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%УсловиеПредметСнабжения%", "И втСтруктураЗаказа.ПредметСнабжения = &ПредметСнабжения");
	
	Возврат Запрос.Выполнить().Выгрузить();
			
КонецФункции

Функция СформироватьТаблицуEqptRoutine(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегламентТОПредметовСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	РегламентТОПредметовСнабжения.ВидРабот КАК ВидРабот,
	|	РегламентТОПредметовСнабжения.Периодичность КАК Периодичность,
	|	ЗИПТребуемыеДляТОПредметовСнабжения.ЗИП КАК ЗИП,
	|	ЗИПТребуемыеДляТОПредметовСнабжения.Количество КАК Количество
	|ПОМЕСТИТЬ втРегламентТО
	|ИЗ
	|	втСтруктураЗаказа КАК втСтруктураЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентТОПредметовСнабжения КАК РегламентТОПредметовСнабжения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗИПТребуемыеДляТОПредметовСнабжения КАК ЗИПТребуемыеДляТОПредметовСнабжения
	|			ПО РегламентТОПредметовСнабжения.ПредметСнабжения = ЗИПТребуемыеДляТОПредметовСнабжения.ПредметСнабжения
	|				И РегламентТОПредметовСнабжения.ВидРабот = ЗИПТребуемыеДляТОПредметовСнабжения.ВидРабот
	|		ПО втСтруктураЗаказа.ПредметСнабжения = РегламентТОПредметовСнабжения.ПредметСнабжения
	|ГДЕ
	|	ЗИПТребуемыеДляТОПредметовСнабжения.Количество > 0
	|	И РегламентТОПредметовСнабжения.ЕдиницаИзмеренияПериодичности = &Час
	|   //%УсловиеПредметСнабжения%
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втРегламентТО.ПредметСнабжения КАК ПредметСнабжения,
	|	ПредметыСнабжения.Код КАК Код,
	|	втРегламентТО.ВидРабот КАК ВидРабот,
	|	втРегламентТО.Периодичность КАК Периодичность,
	|	втРегламентТО.ЗИП КАК ЗИП,
	|	ЗИПы.Код КАК КодЗИП,
	|	втРегламентТО.Количество КАК Количество
	|ИЗ
	|	втРегламентТО КАК втРегламентТО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПредметыСнабжения КАК ПредметыСнабжения
	|		ПО втРегламентТО.ПредметСнабжения = ПредметыСнабжения.ПредметСнабжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПредметыСнабжения КАК ЗИПы
	|		ПО втРегламентТО.ЗИП = ЗИПы.ПредметСнабжения
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втРегламентТО";
	
	Запрос.УстановитьПараметр("Час", Справочники.ОКЕИ.НайтиПоКоду("356"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%УсловиеПредметСнабжения%", "И втСтруктураЗаказа.ПредметСнабжения = &ПредметСнабжения");

	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СформироватьТаблицуCharacteristic(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	втПредметыСнабжения.Код КАК Код,
	|	ПОДСТРОКА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ДополнительныеНаименования.Перевод, """") = """"
	|				ТОГДА ХарактеристикиПредметовСнабжения.Наименование
	|			ИНАЧЕ ДополнительныеНаименования.Перевод
	|		КОНЕЦ, 1, 30) КАК Характеристика,
	|	ПРЕДСТАВЛЕНИЕ(КаталогПредметовСнабженияХарактеристики.Значение) КАК Значение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОКЕИ.УсловноеОбозначениеМеждународное, """") = """"
	|			ТОГДА ЕСТЬNULL(ОКЕИ.Наименование, """")
	|		ИНАЧЕ ЕСТЬNULL(ОКЕИ.УсловноеОбозначениеМеждународное, """")
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ИЗ
	|	втПредметыСнабжения КАК втПредметыСнабжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения.Характеристики КАК КаталогПредметовСнабженияХарактеристики
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеНаименования КАК ДополнительныеНаименования
	|			ПО КаталогПредметовСнабженияХарактеристики.Характеристика = ДополнительныеНаименования.Владелец
	|				И (ДополнительныеНаименования.ИмяРеквизита = ""Наименование"")
	|				И (ДополнительныеНаименования.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Английский))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиПредметовСнабжения КАК ХарактеристикиПредметовСнабжения
	|			ПО КаталогПредметовСнабженияХарактеристики.Характеристика = ХарактеристикиПредметовСнабжения.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКЕИ КАК ОКЕИ
	|			ПО КаталогПредметовСнабженияХарактеристики.ЕдиницаИзмерения = ОКЕИ.Ссылка
	|		ПО втПредметыСнабжения.ПредметСнабжения = КаталогПредметовСнабженияХарактеристики.Ссылка";
	
	Запрос.Текст = Запрос.Текст + "
	|ГДЕ втПредметыСнабжения.ПредметСнабжения = &ПредметСнабжения";

	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из ТЗ_Результат Цикл
	
		Строка.Значение = СокрЛП(Лев(Строка.Значение + " " + Строка.ЕдиницаИзмерения, 60))
	
	КонецЦикла; 
	
	Возврат ТЗ_Результат;
			
КонецФункции

Функция СформироватьТаблицуSubstitute(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Аналоги.ПредметСнабжения КАК ПредметСнабжения,
	|	Аналоги.Код КАК Код,
	|	ЕСТЬNULL(ТипыЗаменыПредметаСнабженияАналогом.Код, """") КАК ТипЗамены,
	|	Оригиналы.ПредметСнабжения КАК ОригиналСсылка,
	|	Оригиналы.Код КАК ОригиналКод
	|ИЗ
	|	втПредметыСнабжения КАК Аналоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПредметыСнабжения КАК Оригиналы
	|		ПО Аналоги.ОригинальныйПредметСнабжения = Оригиналы.ПредметСнабжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЗаменыПредметаСнабженияАналогом КАК ТипыЗаменыПредметаСнабженияАналогом
	|		ПО Аналоги.ТипЗамены = ТипыЗаменыПредметаСнабженияАналогом.Ссылка";
	
	Запрос.Текст = Запрос.Текст + "
	|ГДЕ Оригиналы.ПредметСнабжения = &ПредметСнабжения";
	
	Возврат Запрос.Выполнить().Выгрузить();
			
КонецФункции

Функция СформироватьТаблицуItemVendor(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	втПредметыСнабжения.Код КАК КодПредметаСнабжения,
	|	втОрганизации.Организация КАК Организация,
	|	втОрганизации.Код КАК КодПоставщика,
	|	ПОДСТРОКА(втОрганизации.КодСертификата, 1, 3) КАК КодСертификата,
	|	втОрганизации.НомерСертификата КАК НомерСертификата
	|ИЗ
	|	втПредметыСнабжения КАК втПредметыСнабжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОрганизации КАК втОрганизации
	|		ПО (втОрганизации.ОсновнаяОрганизация)";
	
	Запрос.Текст = Запрос.Текст + "
	|ГДЕ втПредметыСнабжения.ПредметСнабжения = &ПредметСнабжения";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СформироватьТаблицуEASK(Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	втСтруктураЗаказа.Ссылка КАК Ссылка,
	|	втСтруктураЗаказа.Родитель КАК Родитель,
	|	втСтруктураЗаказа.Код КАК Код,
	|	втСтруктураЗаказа.ПредметСнабжения КАК ПредметСнабжения,
	|	втПредметыСнабжения.Код КАК КодПредметаСнабжения,
	|	втСтруктураЗаказа.Количество КАК Количество,
	|	втСтруктураЗаказа.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	втСтруктураЗаказа.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	втСтруктураЗаказа.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	|	втПредметыСнабжения.ДокументНаПоставку КАК ДокументНаПоставку
	|ПОМЕСТИТЬ втСтруктураСДаннымиПС
	|ИЗ
	|	втСтруктураЗаказа КАК втСтруктураЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПредметыСнабжения КАК втПредметыСнабжения
	|		ПО втСтруктураЗаказа.ПредметСнабжения = втПредметыСнабжения.ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРодители.ПредметСнабжения КАК ПредметСнабженияРодителя,
	|	втРодители.КодПредметаСнабжения КАК КодПредметаСнабженияРодителя,
	|	втРодители.Код КАК КодРодителя,
	|	втСтруктураСДаннымиПС.ПредметСнабжения КАК ПредметСнабжения,
	|	втСтруктураСДаннымиПС.КодПредметаСнабжения КАК КодПредметаСнабжения,
	|	втСтруктураСДаннымиПС.Код КАК Код,
	|	втРодители.ДокументНаПоставку КАК ДокументНаПоставку,
	|	втСтруктураСДаннымиПС.Количество КАК Количество,
	|	втСтруктураСДаннымиПС.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	втСтруктураСДаннымиПС.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	втСтруктураСДаннымиПС.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ
	|ИЗ
	|	втСтруктураСДаннымиПС КАК втСтруктураСДаннымиПС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтруктураСДаннымиПС КАК втРодители
	|		ПО втСтруктураСДаннымиПС.Родитель = втРодители.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	//построение иерархии
	Схема = Обработки.ВыгрузкаДанныхВФорматеINCAT.ПолучитьМакет("СхемаEASK");
	Настройки = Схема.НастройкиПоУмолчанию;
	
	КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроекДанных.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроекДанных.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("СтруктураЗаказа", РезультатЗапроса.Выгрузить()));
	
	ТаблицаEASK = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаEASK);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	
	ТЗ_Результат = ОбработатьТаблицуEASK(ТаблицаEASK);
	
	Для каждого Строка Из ТЗ_Результат Цикл
	
		Строка.Уровень = Формат(Строка.Уровень, "ЧЦ=2; ЧН=00; ЧВН=");
		
		Если ЗначениеЗаполнено(Строка.ДокументНаПоставку) Тогда //EASKBookRef
			
			Строка.ДокументНаПоставку = Лев(ОбщиеФункцииКлиентСервер.ТранслитироватьОбозначениеРусВАнг(Строка.ДокументНаПоставку), 32);
			
		КонецЕсли;

	КонецЦикла; 
	
	Возврат ТЗ_Результат;
	
КонецФункции

Функция ОбработатьТаблицуEASK(ТаблицаEASK)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаEASK.Код КАК Код,
	|	ТаблицаEASK.КодРодителя КАК КодРодителя,
	|	ТаблицаEASK.ПредметСнабжения КАК ПредметСнабжения,
	|	ТаблицаEASK.ПредметСнабженияРодителя КАК ПредметСнабженияРодителя,
	|	ТаблицаEASK.КодПредметаСнабжения КАК КодПредметаСнабжения,
	|	ТаблицаEASK.КодПредметаСнабженияРодителя КАК КодПредметаСнабженияРодителя,
	|	ТаблицаEASK.СистемныеПоляУровень КАК СистемныеПоляУровень,
	|	ТаблицаEASK.ДокументНаПоставку КАК ДокументНаПоставку,
	|	ТаблицаEASK.Количество КАК Количество,
	|	ТаблицаEASK.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	ТаблицаEASK.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	ТаблицаEASK.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ
	|ПОМЕСТИТЬ втТаблицаEASK
	|ИЗ
	|	&ТаблицаEASK КАК ТаблицаEASK
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаEASK.Код КАК Код,
	|	втТаблицаEASK.КодРодителя КАК КодРодителя,
	|	втТаблицаEASK.ПредметСнабжения КАК ПредметСнабжения,
	|	втТаблицаEASK.ПредметСнабженияРодителя КАК ПредметСнабженияРодителя,
	|	втТаблицаEASK.КодПредметаСнабжения КАК КодПредметаСнабжения,
	|	втТаблицаEASK.КодПредметаСнабженияРодителя КАК КодПредметаСнабженияРодителя,
	|	МИНИМУМ(втТаблицаEASK.СистемныеПоляУровень - 1) КАК Уровень,
	|	втТаблицаEASK.ДокументНаПоставку КАК ДокументНаПоставку,
	|	втТаблицаEASK.Количество КАК Количество,
	|	втТаблицаEASK.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	втТаблицаEASK.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	втТаблицаEASK.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ
	|ИЗ
	|	втТаблицаEASK КАК втТаблицаEASK
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаEASK.ДокументНаПоставку,
	|	втТаблицаEASK.КодРодителя,
	|	втТаблицаEASK.Код,
	|	втТаблицаEASK.ПредметСнабжения,
	|	втТаблицаEASK.Количество,
	|	втТаблицаEASK.КодПредметаСнабженияРодителя,
	|	втТаблицаEASK.ПредметСнабженияРодителя,
	|	втТаблицаEASK.КодПредметаСнабжения,
	|	втТаблицаEASK.КоличествоВЗИПБорт,
	|	втТаблицаEASK.КоличествоВЗИПБаза,
	|	втТаблицаEASK.КоличествоВЗИПДЭ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втТаблицаEASK";
	Запрос.УстановитьПараметр("ТаблицаEASK", ТаблицаEASK);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
